zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/spi.h
/**
 * \file
 *
 * \brief Component description for SPI
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_SPI_COMPONENT_
#define _SAM4L_SPI_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SPI */
/* ========================================================================== */
/** \addtogroup SAM4L_SPI Serial Peripheral Interface */
/*@{*/

#define SPI_I7602
#define REV_SPI                     0x211

/* -------- SPI_CR : (SPI Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SPIEN:1;          /*!< bit:      0  SPI Enable                         */
    uint32_t SPIDIS:1;         /*!< bit:      1  SPI Disable                        */
    uint32_t :5;               /*!< bit:  2.. 6  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      7  SPI Software Reset                 */
    uint32_t FLUSHFIFO:1;      /*!< bit:      8  Flush FIFO command                 */
    uint32_t :15;              /*!< bit:  9..23  Reserved                           */
    uint32_t LASTXFER:1;       /*!< bit:     24  Last Transfer                      */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_CR_OFFSET               0x00         /**< \brief (SPI_CR offset) Control Register */
#define SPI_CR_RESETVALUE           _U_(0x00000000); /**< \brief (SPI_CR reset_value) Control Register */

#define SPI_CR_SPIEN_Pos            0            /**< \brief (SPI_CR) SPI Enable */
#define SPI_CR_SPIEN                (_U_(0x1) << SPI_CR_SPIEN_Pos)
#define   SPI_CR_SPIEN_0_Val              _U_(0x0)   /**< \brief (SPI_CR) No effect. */
#define   SPI_CR_SPIEN_1_Val              _U_(0x1)   /**< \brief (SPI_CR) Enables the SPI to transfer and receive data. */
#define SPI_CR_SPIEN_0              (SPI_CR_SPIEN_0_Val            << SPI_CR_SPIEN_Pos)
#define SPI_CR_SPIEN_1              (SPI_CR_SPIEN_1_Val            << SPI_CR_SPIEN_Pos)
#define SPI_CR_SPIDIS_Pos           1            /**< \brief (SPI_CR) SPI Disable */
#define SPI_CR_SPIDIS               (_U_(0x1) << SPI_CR_SPIDIS_Pos)
#define   SPI_CR_SPIDIS_0_Val             _U_(0x0)   /**< \brief (SPI_CR) No effect. */
#define   SPI_CR_SPIDIS_1_Val             _U_(0x1)   /**< \brief (SPI_CR) Disables the SPI.All pins are set in input mode and no data is received or transmitted.If a transfer is in progress, the transfer is finished before the SPI is disabled.If both SPIEN and SPIDIS are equal to one when the control register is written, the SPI is disabled. */
#define SPI_CR_SPIDIS_0             (SPI_CR_SPIDIS_0_Val           << SPI_CR_SPIDIS_Pos)
#define SPI_CR_SPIDIS_1             (SPI_CR_SPIDIS_1_Val           << SPI_CR_SPIDIS_Pos)
#define SPI_CR_SWRST_Pos            7            /**< \brief (SPI_CR) SPI Software Reset */
#define SPI_CR_SWRST                (_U_(0x1) << SPI_CR_SWRST_Pos)
#define   SPI_CR_SWRST_0_Val              _U_(0x0)   /**< \brief (SPI_CR) No effect. */
#define   SPI_CR_SWRST_1_Val              _U_(0x1)   /**< \brief (SPI_CR) Reset the SPI. A software-triggered hardware reset of the SPI interface is performed. */
#define SPI_CR_SWRST_0              (SPI_CR_SWRST_0_Val            << SPI_CR_SWRST_Pos)
#define SPI_CR_SWRST_1              (SPI_CR_SWRST_1_Val            << SPI_CR_SWRST_Pos)
#define SPI_CR_FLUSHFIFO_Pos        8            /**< \brief (SPI_CR) Flush FIFO command */
#define SPI_CR_FLUSHFIFO            (_U_(0x1) << SPI_CR_FLUSHFIFO_Pos)
#define SPI_CR_LASTXFER_Pos         24           /**< \brief (SPI_CR) Last Transfer */
#define SPI_CR_LASTXFER             (_U_(0x1) << SPI_CR_LASTXFER_Pos)
#define   SPI_CR_LASTXFER_0_Val           _U_(0x0)   /**< \brief (SPI_CR) No effect. */
#define   SPI_CR_LASTXFER_1_Val           _U_(0x1)   /**< \brief (SPI_CR) The current NPCS will be deasserted after the character written in TD has been transferred. When CSAAT is set, thisallows to close the communication with the current serial peripheral by raising the corresponding NPCS line as soon as TDtransfer has completed. */
#define SPI_CR_LASTXFER_0           (SPI_CR_LASTXFER_0_Val         << SPI_CR_LASTXFER_Pos)
#define SPI_CR_LASTXFER_1           (SPI_CR_LASTXFER_1_Val         << SPI_CR_LASTXFER_Pos)
#define SPI_CR_MASK                 _U_(0x01000183) /**< \brief (SPI_CR) MASK Register */

/* -------- SPI_MR : (SPI Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MSTR:1;           /*!< bit:      0  Master/Slave Mode                  */
    uint32_t PS:1;             /*!< bit:      1  Peripheral Select                  */
    uint32_t PCSDEC:1;         /*!< bit:      2  Chip Select Decode                 */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t MODFDIS:1;        /*!< bit:      4  Mode Fault Detection               */
    uint32_t WDRBT:1;          /*!< bit:      5  wait data read before transfer     */
    uint32_t RXFIFOEN:1;       /*!< bit:      6  FIFO in Reception Enable           */
    uint32_t LLB:1;            /*!< bit:      7  Local Loopback Enable              */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t PCS:4;            /*!< bit: 16..19  Peripheral Chip Select             */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t DLYBCS:8;         /*!< bit: 24..31  Delay Between Chip Selects         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_MR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

