zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/spi.h
/* -------- SPI_SR : (SPI Offset: 0x10) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDRF:1;           /*!< bit:      0  Receive Data Register Full         */
    uint32_t TDRE:1;           /*!< bit:      1  Transmit Data Register Empty       */
    uint32_t MODF:1;           /*!< bit:      2  Mode Fault Error                   */
    uint32_t OVRES:1;          /*!< bit:      3  Overrun Error Status               */
    uint32_t ENDRX:1;          /*!< bit:      4  End of RX buffer                   */
    uint32_t ENDTX:1;          /*!< bit:      5  End of TX buffer                   */
    uint32_t RXBUFF:1;         /*!< bit:      6  RX Buffer Full                     */
    uint32_t TXBUFE:1;         /*!< bit:      7  TX Buffer Empty                    */
    uint32_t NSSR:1;           /*!< bit:      8  NSS Rising                         */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmission Registers Empty       */
    uint32_t UNDES:1;          /*!< bit:     10  Underrun Error Status (Slave Mode Only) */
    uint32_t :5;               /*!< bit: 11..15  Reserved                           */
    uint32_t SPIENS:1;         /*!< bit:     16  SPI Enable Status                  */
    uint32_t :15;              /*!< bit: 17..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_SR_OFFSET               0x10         /**< \brief (SPI_SR offset) Status Register */
#define SPI_SR_RESETVALUE           _U_(0x000000F0); /**< \brief (SPI_SR reset_value) Status Register */

#define SPI_SR_RDRF_Pos             0            /**< \brief (SPI_SR) Receive Data Register Full */
#define SPI_SR_RDRF                 (_U_(0x1) << SPI_SR_RDRF_Pos)
#define   SPI_SR_RDRF_0_Val               _U_(0x0)   /**< \brief (SPI_SR) No data has been received since the last read of RDR */
#define   SPI_SR_RDRF_1_Val               _U_(0x1)   /**< \brief (SPI_SR) Data has been received and the received data has been transferred from the serializer to RDR since the last readof RDR. */
#define SPI_SR_RDRF_0               (SPI_SR_RDRF_0_Val             << SPI_SR_RDRF_Pos)
#define SPI_SR_RDRF_1               (SPI_SR_RDRF_1_Val             << SPI_SR_RDRF_Pos)
#define SPI_SR_TDRE_Pos             1            /**< \brief (SPI_SR) Transmit Data Register Empty */
#define SPI_SR_TDRE                 (_U_(0x1) << SPI_SR_TDRE_Pos)
#define   SPI_SR_TDRE_0_Val               _U_(0x0)   /**< \brief (SPI_SR) Data has been written to TDR and not yet transferred to the serializer. */
#define   SPI_SR_TDRE_1_Val               _U_(0x1)   /**< \brief (SPI_SR) The last data written in the Transmit Data Register has been transferred to the serializer.TDRE equals zero when the SPI is disabled or at reset. The SPI enable command sets this bit to one. */
#define SPI_SR_TDRE_0               (SPI_SR_TDRE_0_Val             << SPI_SR_TDRE_Pos)
#define SPI_SR_TDRE_1               (SPI_SR_TDRE_1_Val             << SPI_SR_TDRE_Pos)
#define SPI_SR_MODF_Pos             2            /**< \brief (SPI_SR) Mode Fault Error */
#define SPI_SR_MODF                 (_U_(0x1) << SPI_SR_MODF_Pos)
#define   SPI_SR_MODF_0_Val               _U_(0x0)   /**< \brief (SPI_SR) No Mode Fault has been detected since the last read of SR. */
#define   SPI_SR_MODF_1_Val               _U_(0x1)   /**< \brief (SPI_SR) A Mode Fault occurred since the last read of the SR. */
#define SPI_SR_MODF_0               (SPI_SR_MODF_0_Val             << SPI_SR_MODF_Pos)
#define SPI_SR_MODF_1               (SPI_SR_MODF_1_Val             << SPI_SR_MODF_Pos)
#define SPI_SR_OVRES_Pos            3            /**< \brief (SPI_SR) Overrun Error Status */
#define SPI_SR_OVRES                (_U_(0x1) << SPI_SR_OVRES_Pos)
#define   SPI_SR_OVRES_0_Val              _U_(0x0)   /**< \brief (SPI_SR) No overrun has been detected since the last read of SR. */
#define   SPI_SR_OVRES_1_Val              _U_(0x1)   /**< \brief (SPI_SR) An overrun has occurred since the last read of SR. */
#define SPI_SR_OVRES_0              (SPI_SR_OVRES_0_Val            << SPI_SR_OVRES_Pos)
#define SPI_SR_OVRES_1              (SPI_SR_OVRES_1_Val            << SPI_SR_OVRES_Pos)
#define SPI_SR_ENDRX_Pos            4            /**< \brief (SPI_SR) End of RX buffer */
#define SPI_SR_ENDRX                (_U_(0x1) << SPI_SR_ENDRX_Pos)
#define   SPI_SR_ENDRX_0_Val              _U_(0x0)   /**< \brief (SPI_SR) The Receive Counter Register has not reached 0 since the last write in RCR or RNCR. */
#define   SPI_SR_ENDRX_1_Val              _U_(0x1)   /**< \brief (SPI_SR) The Receive Counter Register has reached 0 since the last write in RCR or RNCR. */
#define SPI_SR_ENDRX_0              (SPI_SR_ENDRX_0_Val            << SPI_SR_ENDRX_Pos)
#define SPI_SR_ENDRX_1              (SPI_SR_ENDRX_1_Val            << SPI_SR_ENDRX_Pos)
#define SPI_SR_ENDTX_Pos            5            /**< \brief (SPI_SR) End of TX buffer */
#define SPI_SR_ENDTX                (_U_(0x1) << SPI_SR_ENDTX_Pos)
#define   SPI_SR_ENDTX_0_Val              _U_(0x0)   /**< \brief (SPI_SR) The Transmit Counter Register has not reached 0 since the last write in TCR or TNCR. */
#define   SPI_SR_ENDTX_1_Val              _U_(0x1)   /**< \brief (SPI_SR) The Transmit Counter Register has reached 0 since the last write in TCR or TNCR. */
#define SPI_SR_ENDTX_0              (SPI_SR_ENDTX_0_Val            << SPI_SR_ENDTX_Pos)
#define SPI_SR_ENDTX_1              (SPI_SR_ENDTX_1_Val            << SPI_SR_ENDTX_Pos)
#define SPI_SR_RXBUFF_Pos           6            /**< \brief (SPI_SR) RX Buffer Full */
#define SPI_SR_RXBUFF               (_U_(0x1) << SPI_SR_RXBUFF_Pos)
#define   SPI_SR_RXBUFF_0_Val             _U_(0x0)   /**< \brief (SPI_SR) RCR or RNCR has a value other than 0. */
#define   SPI_SR_RXBUFF_1_Val             _U_(0x1)   /**< \brief (SPI_SR) Both RCR and RNCR has a value of 0. */
#define SPI_SR_RXBUFF_0             (SPI_SR_RXBUFF_0_Val           << SPI_SR_RXBUFF_Pos)
#define SPI_SR_RXBUFF_1             (SPI_SR_RXBUFF_1_Val           << SPI_SR_RXBUFF_Pos)
#define SPI_SR_TXBUFE_Pos           7            /**< \brief (SPI_SR) TX Buffer Empty */
#define SPI_SR_TXBUFE               (_U_(0x1) << SPI_SR_TXBUFE_Pos)
#define   SPI_SR_TXBUFE_0_Val             _U_(0x0)   /**< \brief (SPI_SR) TCR or TNCR has a value other than 0. */
#define   SPI_SR_TXBUFE_1_Val             _U_(0x1)   /**< \brief (SPI_SR) Both TCR and TNCR has a value of 0. */
#define SPI_SR_TXBUFE_0             (SPI_SR_TXBUFE_0_Val           << SPI_SR_TXBUFE_Pos)
#define SPI_SR_TXBUFE_1             (SPI_SR_TXBUFE_1_Val           << SPI_SR_TXBUFE_Pos)
#define SPI_SR_NSSR_Pos             8            /**< \brief (SPI_SR) NSS Rising */
#define SPI_SR_NSSR                 (_U_(0x1) << SPI_SR_NSSR_Pos)
#define   SPI_SR_NSSR_0_Val               _U_(0x0)   /**< \brief (SPI_SR) No rising edge detected on NSS pin since last read. */
#define   SPI_SR_NSSR_1_Val               _U_(0x1)   /**< \brief (SPI_SR) A rising edge occurred on NSS pin since last read. */
#define SPI_SR_NSSR_0               (SPI_SR_NSSR_0_Val             << SPI_SR_NSSR_Pos)
#define SPI_SR_NSSR_1               (SPI_SR_NSSR_1_Val             << SPI_SR_NSSR_Pos)
#define SPI_SR_TXEMPTY_Pos          9            /**< \brief (SPI_SR) Transmission Registers Empty */
#define SPI_SR_TXEMPTY              (_U_(0x1) << SPI_SR_TXEMPTY_Pos)
#define   SPI_SR_TXEMPTY_0_Val            _U_(0x0)   /**< \brief (SPI_SR) As soon as data is written in TDR. */
#define   SPI_SR_TXEMPTY_1_Val            _U_(0x1)   /**< \brief (SPI_SR) TDR and internal shifter are empty. If a transfer delay has been defined, TXEMPTY is set after the completion ofsuch delay. */
#define SPI_SR_TXEMPTY_0            (SPI_SR_TXEMPTY_0_Val          << SPI_SR_TXEMPTY_Pos)
#define SPI_SR_TXEMPTY_1            (SPI_SR_TXEMPTY_1_Val          << SPI_SR_TXEMPTY_Pos)
#define SPI_SR_UNDES_Pos            10           /**< \brief (SPI_SR) Underrun Error Status (Slave Mode Only) */
#define SPI_SR_UNDES                (_U_(0x1) << SPI_SR_UNDES_Pos)
#define SPI_SR_SPIENS_Pos           16           /**< \brief (SPI_SR) SPI Enable Status */
#define SPI_SR_SPIENS               (_U_(0x1) << SPI_SR_SPIENS_Pos)
#define   SPI_SR_SPIENS_0_Val             _U_(0x0)   /**< \brief (SPI_SR) SPI is disabled. */
#define   SPI_SR_SPIENS_1_Val             _U_(0x1)   /**< \brief (SPI_SR) SPI is enabled. */
#define SPI_SR_SPIENS_0             (SPI_SR_SPIENS_0_Val           << SPI_SR_SPIENS_Pos)
#define SPI_SR_SPIENS_1             (SPI_SR_SPIENS_1_Val           << SPI_SR_SPIENS_Pos)
#define SPI_SR_MASK                 _U_(0x000107FF) /**< \brief (SPI_SR) MASK Register */

/* -------- SPI_IER : (SPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDRF:1;           /*!< bit:      0  Receive Data Register Full Interrupt Enable */
    uint32_t TDRE:1;           /*!< bit:      1  Transmit Data Register Empty Interrupt Enable */
    uint32_t MODF:1;           /*!< bit:      2  Mode Fault Error Interrupt Enable  */
    uint32_t OVRES:1;          /*!< bit:      3  Overrun Error Interrupt Enable     */
    uint32_t ENDRX:1;          /*!< bit:      4  End of Receive Buffer Interrupt Enable */
    uint32_t ENDTX:1;          /*!< bit:      5  End of Transmit Buffer Interrupt Enable */
    uint32_t RXBUFF:1;         /*!< bit:      6  Receive Buffer Full Interrupt Enable */
    uint32_t TXBUFE:1;         /*!< bit:      7  Transmit Buffer Empty Interrupt Enable */
    uint32_t NSSR:1;           /*!< bit:      8  NSS Rising Interrupt Enable        */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmission Registers Empty Enable */
    uint32_t UNDES:1;          /*!< bit:     10  Underrun Error Interrupt Enable    */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_IER_OFFSET              0x14         /**< \brief (SPI_IER offset) Interrupt Enable Register */
#define SPI_IER_RESETVALUE          _U_(0x00000000); /**< \brief (SPI_IER reset_value) Interrupt Enable Register */

#define SPI_IER_RDRF_Pos            0            /**< \brief (SPI_IER) Receive Data Register Full Interrupt Enable */
#define SPI_IER_RDRF                (_U_(0x1) << SPI_IER_RDRF_Pos)
#define   SPI_IER_RDRF_0_Val              _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_RDRF_1_Val              _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_RDRF_0              (SPI_IER_RDRF_0_Val            << SPI_IER_RDRF_Pos)
#define SPI_IER_RDRF_1              (SPI_IER_RDRF_1_Val            << SPI_IER_RDRF_Pos)
#define SPI_IER_TDRE_Pos            1            /**< \brief (SPI_IER) Transmit Data Register Empty Interrupt Enable */
#define SPI_IER_TDRE                (_U_(0x1) << SPI_IER_TDRE_Pos)
#define   SPI_IER_TDRE_0_Val              _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_TDRE_1_Val              _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_TDRE_0              (SPI_IER_TDRE_0_Val            << SPI_IER_TDRE_Pos)
#define SPI_IER_TDRE_1              (SPI_IER_TDRE_1_Val            << SPI_IER_TDRE_Pos)
#define SPI_IER_MODF_Pos            2            /**< \brief (SPI_IER) Mode Fault Error Interrupt Enable */
#define SPI_IER_MODF                (_U_(0x1) << SPI_IER_MODF_Pos)
#define   SPI_IER_MODF_0_Val              _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_MODF_1_Val              _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_MODF_0              (SPI_IER_MODF_0_Val            << SPI_IER_MODF_Pos)
#define SPI_IER_MODF_1              (SPI_IER_MODF_1_Val            << SPI_IER_MODF_Pos)
#define SPI_IER_OVRES_Pos           3            /**< \brief (SPI_IER) Overrun Error Interrupt Enable */
#define SPI_IER_OVRES               (_U_(0x1) << SPI_IER_OVRES_Pos)
#define   SPI_IER_OVRES_0_Val             _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_OVRES_1_Val             _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_OVRES_0             (SPI_IER_OVRES_0_Val           << SPI_IER_OVRES_Pos)
#define SPI_IER_OVRES_1             (SPI_IER_OVRES_1_Val           << SPI_IER_OVRES_Pos)
#define SPI_IER_ENDRX_Pos           4            /**< \brief (SPI_IER) End of Receive Buffer Interrupt Enable */
#define SPI_IER_ENDRX               (_U_(0x1) << SPI_IER_ENDRX_Pos)
#define   SPI_IER_ENDRX_0_Val             _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_ENDRX_1_Val             _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_ENDRX_0             (SPI_IER_ENDRX_0_Val           << SPI_IER_ENDRX_Pos)
#define SPI_IER_ENDRX_1             (SPI_IER_ENDRX_1_Val           << SPI_IER_ENDRX_Pos)
#define SPI_IER_ENDTX_Pos           5            /**< \brief (SPI_IER) End of Transmit Buffer Interrupt Enable */
#define SPI_IER_ENDTX               (_U_(0x1) << SPI_IER_ENDTX_Pos)
#define   SPI_IER_ENDTX_0_Val             _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_ENDTX_1_Val             _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_ENDTX_0             (SPI_IER_ENDTX_0_Val           << SPI_IER_ENDTX_Pos)
#define SPI_IER_ENDTX_1             (SPI_IER_ENDTX_1_Val           << SPI_IER_ENDTX_Pos)
#define SPI_IER_RXBUFF_Pos          6            /**< \brief (SPI_IER) Receive Buffer Full Interrupt Enable */
#define SPI_IER_RXBUFF              (_U_(0x1) << SPI_IER_RXBUFF_Pos)
#define   SPI_IER_RXBUFF_0_Val            _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_RXBUFF_1_Val            _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_RXBUFF_0            (SPI_IER_RXBUFF_0_Val          << SPI_IER_RXBUFF_Pos)
#define SPI_IER_RXBUFF_1            (SPI_IER_RXBUFF_1_Val          << SPI_IER_RXBUFF_Pos)
#define SPI_IER_TXBUFE_Pos          7            /**< \brief (SPI_IER) Transmit Buffer Empty Interrupt Enable */
#define SPI_IER_TXBUFE              (_U_(0x1) << SPI_IER_TXBUFE_Pos)
#define   SPI_IER_TXBUFE_0_Val            _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_TXBUFE_1_Val            _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_TXBUFE_0            (SPI_IER_TXBUFE_0_Val          << SPI_IER_TXBUFE_Pos)
#define SPI_IER_TXBUFE_1            (SPI_IER_TXBUFE_1_Val          << SPI_IER_TXBUFE_Pos)
#define SPI_IER_NSSR_Pos            8            /**< \brief (SPI_IER) NSS Rising Interrupt Enable */
#define SPI_IER_NSSR                (_U_(0x1) << SPI_IER_NSSR_Pos)
#define   SPI_IER_NSSR_0_Val              _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_NSSR_1_Val              _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_NSSR_0              (SPI_IER_NSSR_0_Val            << SPI_IER_NSSR_Pos)
#define SPI_IER_NSSR_1              (SPI_IER_NSSR_1_Val            << SPI_IER_NSSR_Pos)
#define SPI_IER_TXEMPTY_Pos         9            /**< \brief (SPI_IER) Transmission Registers Empty Enable */
#define SPI_IER_TXEMPTY             (_U_(0x1) << SPI_IER_TXEMPTY_Pos)
#define   SPI_IER_TXEMPTY_0_Val           _U_(0x0)   /**< \brief (SPI_IER) No effect. */
#define   SPI_IER_TXEMPTY_1_Val           _U_(0x1)   /**< \brief (SPI_IER) Enables the corresponding interrupt. */
#define SPI_IER_TXEMPTY_0           (SPI_IER_TXEMPTY_0_Val         << SPI_IER_TXEMPTY_Pos)
#define SPI_IER_TXEMPTY_1           (SPI_IER_TXEMPTY_1_Val         << SPI_IER_TXEMPTY_Pos)
#define SPI_IER_UNDES_Pos           10           /**< \brief (SPI_IER) Underrun Error Interrupt Enable */
#define SPI_IER_UNDES               (_U_(0x1) << SPI_IER_UNDES_Pos)
#define SPI_IER_MASK                _U_(0x000007FF) /**< \brief (SPI_IER) MASK Register */

