zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/spi.h
/* -------- SPI_IDR : (SPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDRF:1;           /*!< bit:      0  Receive Data Register Full Interrupt Disable */
    uint32_t TDRE:1;           /*!< bit:      1  Transmit Data Register Empty Interrupt Disable */
    uint32_t MODF:1;           /*!< bit:      2  Mode Fault Error Interrupt Disable */
    uint32_t OVRES:1;          /*!< bit:      3  Overrun Error Interrupt Disable    */
    uint32_t ENDRX:1;          /*!< bit:      4  End of Receive Buffer Interrupt Disable */
    uint32_t ENDTX:1;          /*!< bit:      5  End of Transmit Buffer Interrupt Disable */
    uint32_t RXBUFF:1;         /*!< bit:      6  Receive Buffer Full Interrupt Disable */
    uint32_t TXBUFE:1;         /*!< bit:      7  Transmit Buffer Empty Interrupt Disable */
    uint32_t NSSR:1;           /*!< bit:      8  NSS Rising Interrupt Disable       */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmission Registers Empty Disable */
    uint32_t UNDES:1;          /*!< bit:     10  Underrun Error Interrupt Disable   */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_IDR_OFFSET              0x18         /**< \brief (SPI_IDR offset) Interrupt Disable Register */
#define SPI_IDR_RESETVALUE          _U_(0x00000000); /**< \brief (SPI_IDR reset_value) Interrupt Disable Register */

#define SPI_IDR_RDRF_Pos            0            /**< \brief (SPI_IDR) Receive Data Register Full Interrupt Disable */
#define SPI_IDR_RDRF                (_U_(0x1) << SPI_IDR_RDRF_Pos)
#define   SPI_IDR_RDRF_0_Val              _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_RDRF_1_Val              _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_RDRF_0              (SPI_IDR_RDRF_0_Val            << SPI_IDR_RDRF_Pos)
#define SPI_IDR_RDRF_1              (SPI_IDR_RDRF_1_Val            << SPI_IDR_RDRF_Pos)
#define SPI_IDR_TDRE_Pos            1            /**< \brief (SPI_IDR) Transmit Data Register Empty Interrupt Disable */
#define SPI_IDR_TDRE                (_U_(0x1) << SPI_IDR_TDRE_Pos)
#define   SPI_IDR_TDRE_0_Val              _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_TDRE_1_Val              _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_TDRE_0              (SPI_IDR_TDRE_0_Val            << SPI_IDR_TDRE_Pos)
#define SPI_IDR_TDRE_1              (SPI_IDR_TDRE_1_Val            << SPI_IDR_TDRE_Pos)
#define SPI_IDR_MODF_Pos            2            /**< \brief (SPI_IDR) Mode Fault Error Interrupt Disable */
#define SPI_IDR_MODF                (_U_(0x1) << SPI_IDR_MODF_Pos)
#define   SPI_IDR_MODF_0_Val              _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_MODF_1_Val              _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_MODF_0              (SPI_IDR_MODF_0_Val            << SPI_IDR_MODF_Pos)
#define SPI_IDR_MODF_1              (SPI_IDR_MODF_1_Val            << SPI_IDR_MODF_Pos)
#define SPI_IDR_OVRES_Pos           3            /**< \brief (SPI_IDR) Overrun Error Interrupt Disable */
#define SPI_IDR_OVRES               (_U_(0x1) << SPI_IDR_OVRES_Pos)
#define   SPI_IDR_OVRES_0_Val             _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_OVRES_1_Val             _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_OVRES_0             (SPI_IDR_OVRES_0_Val           << SPI_IDR_OVRES_Pos)
#define SPI_IDR_OVRES_1             (SPI_IDR_OVRES_1_Val           << SPI_IDR_OVRES_Pos)
#define SPI_IDR_ENDRX_Pos           4            /**< \brief (SPI_IDR) End of Receive Buffer Interrupt Disable */
#define SPI_IDR_ENDRX               (_U_(0x1) << SPI_IDR_ENDRX_Pos)
#define   SPI_IDR_ENDRX_0_Val             _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_ENDRX_1_Val             _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_ENDRX_0             (SPI_IDR_ENDRX_0_Val           << SPI_IDR_ENDRX_Pos)
#define SPI_IDR_ENDRX_1             (SPI_IDR_ENDRX_1_Val           << SPI_IDR_ENDRX_Pos)
#define SPI_IDR_ENDTX_Pos           5            /**< \brief (SPI_IDR) End of Transmit Buffer Interrupt Disable */
#define SPI_IDR_ENDTX               (_U_(0x1) << SPI_IDR_ENDTX_Pos)
#define   SPI_IDR_ENDTX_0_Val             _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_ENDTX_1_Val             _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_ENDTX_0             (SPI_IDR_ENDTX_0_Val           << SPI_IDR_ENDTX_Pos)
#define SPI_IDR_ENDTX_1             (SPI_IDR_ENDTX_1_Val           << SPI_IDR_ENDTX_Pos)
#define SPI_IDR_RXBUFF_Pos          6            /**< \brief (SPI_IDR) Receive Buffer Full Interrupt Disable */
#define SPI_IDR_RXBUFF              (_U_(0x1) << SPI_IDR_RXBUFF_Pos)
#define   SPI_IDR_RXBUFF_0_Val            _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_RXBUFF_1_Val            _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_RXBUFF_0            (SPI_IDR_RXBUFF_0_Val          << SPI_IDR_RXBUFF_Pos)
#define SPI_IDR_RXBUFF_1            (SPI_IDR_RXBUFF_1_Val          << SPI_IDR_RXBUFF_Pos)
#define SPI_IDR_TXBUFE_Pos          7            /**< \brief (SPI_IDR) Transmit Buffer Empty Interrupt Disable */
#define SPI_IDR_TXBUFE              (_U_(0x1) << SPI_IDR_TXBUFE_Pos)
#define   SPI_IDR_TXBUFE_0_Val            _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_TXBUFE_1_Val            _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_TXBUFE_0            (SPI_IDR_TXBUFE_0_Val          << SPI_IDR_TXBUFE_Pos)
#define SPI_IDR_TXBUFE_1            (SPI_IDR_TXBUFE_1_Val          << SPI_IDR_TXBUFE_Pos)
#define SPI_IDR_NSSR_Pos            8            /**< \brief (SPI_IDR) NSS Rising Interrupt Disable */
#define SPI_IDR_NSSR                (_U_(0x1) << SPI_IDR_NSSR_Pos)
#define   SPI_IDR_NSSR_0_Val              _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_NSSR_1_Val              _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_NSSR_0              (SPI_IDR_NSSR_0_Val            << SPI_IDR_NSSR_Pos)
#define SPI_IDR_NSSR_1              (SPI_IDR_NSSR_1_Val            << SPI_IDR_NSSR_Pos)
#define SPI_IDR_TXEMPTY_Pos         9            /**< \brief (SPI_IDR) Transmission Registers Empty Disable */
#define SPI_IDR_TXEMPTY             (_U_(0x1) << SPI_IDR_TXEMPTY_Pos)
#define   SPI_IDR_TXEMPTY_0_Val           _U_(0x0)   /**< \brief (SPI_IDR) No effect. */
#define   SPI_IDR_TXEMPTY_1_Val           _U_(0x1)   /**< \brief (SPI_IDR) Disables the corresponding interrupt. */
#define SPI_IDR_TXEMPTY_0           (SPI_IDR_TXEMPTY_0_Val         << SPI_IDR_TXEMPTY_Pos)
#define SPI_IDR_TXEMPTY_1           (SPI_IDR_TXEMPTY_1_Val         << SPI_IDR_TXEMPTY_Pos)
#define SPI_IDR_UNDES_Pos           10           /**< \brief (SPI_IDR) Underrun Error Interrupt Disable */
#define SPI_IDR_UNDES               (_U_(0x1) << SPI_IDR_UNDES_Pos)
#define SPI_IDR_MASK                _U_(0x000007FF) /**< \brief (SPI_IDR) MASK Register */

/* -------- SPI_IMR : (SPI Offset: 0x1C) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDRF:1;           /*!< bit:      0  Receive Data Register Full Interrupt Mask */
    uint32_t TDRE:1;           /*!< bit:      1  Transmit Data Register Empty Interrupt Mask */
    uint32_t MODF:1;           /*!< bit:      2  Mode Fault Error Interrupt Mask    */
    uint32_t OVRES:1;          /*!< bit:      3  Overrun Error Interrupt Mask       */
    uint32_t ENDRX:1;          /*!< bit:      4  End of Receive Buffer Interrupt Mask */
    uint32_t ENDTX:1;          /*!< bit:      5  End of Transmit Buffer Interrupt Mask */
    uint32_t RXBUFF:1;         /*!< bit:      6  Receive Buffer Full Interrupt Mask */
    uint32_t TXBUFE:1;         /*!< bit:      7  Transmit Buffer Empty Interrupt Mask */
    uint32_t NSSR:1;           /*!< bit:      8  NSS Rising Interrupt Mask          */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmission Registers Empty Mask  */
    uint32_t UNDES:1;          /*!< bit:     10  Underrun Error Interrupt Mask      */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_IMR_OFFSET              0x1C         /**< \brief (SPI_IMR offset) Interrupt Mask Register */
#define SPI_IMR_RESETVALUE          _U_(0x00000000); /**< \brief (SPI_IMR reset_value) Interrupt Mask Register */

#define SPI_IMR_RDRF_Pos            0            /**< \brief (SPI_IMR) Receive Data Register Full Interrupt Mask */
#define SPI_IMR_RDRF                (_U_(0x1) << SPI_IMR_RDRF_Pos)
#define   SPI_IMR_RDRF_0_Val              _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_RDRF_1_Val              _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_RDRF_0              (SPI_IMR_RDRF_0_Val            << SPI_IMR_RDRF_Pos)
#define SPI_IMR_RDRF_1              (SPI_IMR_RDRF_1_Val            << SPI_IMR_RDRF_Pos)
#define SPI_IMR_TDRE_Pos            1            /**< \brief (SPI_IMR) Transmit Data Register Empty Interrupt Mask */
#define SPI_IMR_TDRE                (_U_(0x1) << SPI_IMR_TDRE_Pos)
#define   SPI_IMR_TDRE_0_Val              _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_TDRE_1_Val              _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_TDRE_0              (SPI_IMR_TDRE_0_Val            << SPI_IMR_TDRE_Pos)
#define SPI_IMR_TDRE_1              (SPI_IMR_TDRE_1_Val            << SPI_IMR_TDRE_Pos)
#define SPI_IMR_MODF_Pos            2            /**< \brief (SPI_IMR) Mode Fault Error Interrupt Mask */
#define SPI_IMR_MODF                (_U_(0x1) << SPI_IMR_MODF_Pos)
#define   SPI_IMR_MODF_0_Val              _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_MODF_1_Val              _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_MODF_0              (SPI_IMR_MODF_0_Val            << SPI_IMR_MODF_Pos)
#define SPI_IMR_MODF_1              (SPI_IMR_MODF_1_Val            << SPI_IMR_MODF_Pos)
#define SPI_IMR_OVRES_Pos           3            /**< \brief (SPI_IMR) Overrun Error Interrupt Mask */
#define SPI_IMR_OVRES               (_U_(0x1) << SPI_IMR_OVRES_Pos)
#define   SPI_IMR_OVRES_0_Val             _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_OVRES_1_Val             _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_OVRES_0             (SPI_IMR_OVRES_0_Val           << SPI_IMR_OVRES_Pos)
#define SPI_IMR_OVRES_1             (SPI_IMR_OVRES_1_Val           << SPI_IMR_OVRES_Pos)
#define SPI_IMR_ENDRX_Pos           4            /**< \brief (SPI_IMR) End of Receive Buffer Interrupt Mask */
#define SPI_IMR_ENDRX               (_U_(0x1) << SPI_IMR_ENDRX_Pos)
#define   SPI_IMR_ENDRX_0_Val             _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_ENDRX_1_Val             _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_ENDRX_0             (SPI_IMR_ENDRX_0_Val           << SPI_IMR_ENDRX_Pos)
#define SPI_IMR_ENDRX_1             (SPI_IMR_ENDRX_1_Val           << SPI_IMR_ENDRX_Pos)
#define SPI_IMR_ENDTX_Pos           5            /**< \brief (SPI_IMR) End of Transmit Buffer Interrupt Mask */
#define SPI_IMR_ENDTX               (_U_(0x1) << SPI_IMR_ENDTX_Pos)
#define   SPI_IMR_ENDTX_0_Val             _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_ENDTX_1_Val             _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_ENDTX_0             (SPI_IMR_ENDTX_0_Val           << SPI_IMR_ENDTX_Pos)
#define SPI_IMR_ENDTX_1             (SPI_IMR_ENDTX_1_Val           << SPI_IMR_ENDTX_Pos)
#define SPI_IMR_RXBUFF_Pos          6            /**< \brief (SPI_IMR) Receive Buffer Full Interrupt Mask */
#define SPI_IMR_RXBUFF              (_U_(0x1) << SPI_IMR_RXBUFF_Pos)
#define   SPI_IMR_RXBUFF_0_Val            _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_RXBUFF_1_Val            _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_RXBUFF_0            (SPI_IMR_RXBUFF_0_Val          << SPI_IMR_RXBUFF_Pos)
#define SPI_IMR_RXBUFF_1            (SPI_IMR_RXBUFF_1_Val          << SPI_IMR_RXBUFF_Pos)
#define SPI_IMR_TXBUFE_Pos          7            /**< \brief (SPI_IMR) Transmit Buffer Empty Interrupt Mask */
#define SPI_IMR_TXBUFE              (_U_(0x1) << SPI_IMR_TXBUFE_Pos)
#define   SPI_IMR_TXBUFE_0_Val            _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_TXBUFE_1_Val            _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_TXBUFE_0            (SPI_IMR_TXBUFE_0_Val          << SPI_IMR_TXBUFE_Pos)
#define SPI_IMR_TXBUFE_1            (SPI_IMR_TXBUFE_1_Val          << SPI_IMR_TXBUFE_Pos)
#define SPI_IMR_NSSR_Pos            8            /**< \brief (SPI_IMR) NSS Rising Interrupt Mask */
#define SPI_IMR_NSSR                (_U_(0x1) << SPI_IMR_NSSR_Pos)
#define   SPI_IMR_NSSR_0_Val              _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_NSSR_1_Val              _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_NSSR_0              (SPI_IMR_NSSR_0_Val            << SPI_IMR_NSSR_Pos)
#define SPI_IMR_NSSR_1              (SPI_IMR_NSSR_1_Val            << SPI_IMR_NSSR_Pos)
#define SPI_IMR_TXEMPTY_Pos         9            /**< \brief (SPI_IMR) Transmission Registers Empty Mask */
#define SPI_IMR_TXEMPTY             (_U_(0x1) << SPI_IMR_TXEMPTY_Pos)
#define   SPI_IMR_TXEMPTY_0_Val           _U_(0x0)   /**< \brief (SPI_IMR) The corresponding interrupt is not enabled. */
#define   SPI_IMR_TXEMPTY_1_Val           _U_(0x1)   /**< \brief (SPI_IMR) The corresponding interrupt is enabled. */
#define SPI_IMR_TXEMPTY_0           (SPI_IMR_TXEMPTY_0_Val         << SPI_IMR_TXEMPTY_Pos)
#define SPI_IMR_TXEMPTY_1           (SPI_IMR_TXEMPTY_1_Val         << SPI_IMR_TXEMPTY_Pos)
#define SPI_IMR_UNDES_Pos           10           /**< \brief (SPI_IMR) Underrun Error Interrupt Mask */
#define SPI_IMR_UNDES               (_U_(0x1) << SPI_IMR_UNDES_Pos)
#define SPI_IMR_MASK                _U_(0x000007FF) /**< \brief (SPI_IMR) MASK Register */

/* -------- SPI_CSR : (SPI Offset: 0x30) (R/W 32) Chip Select Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CPOL:1;           /*!< bit:      0  Clock Polarity                     */
    uint32_t NCPHA:1;          /*!< bit:      1  Clock Phase                        */
    uint32_t CSNAAT:1;         /*!< bit:      2  Chip Select Not Active After Transfer */
    uint32_t CSAAT:1;          /*!< bit:      3  Chip Select Active After Transfer  */
    uint32_t BITS:4;           /*!< bit:  4.. 7  Bits Per Transfer                  */
    uint32_t SCBR:8;           /*!< bit:  8..15  Serial Clock Baud Rate             */
    uint32_t DLYBS:8;          /*!< bit: 16..23  Delay Before SPCK                  */
    uint32_t DLYBCT:8;         /*!< bit: 24..31  Delay Between Consecutive Transfers */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_CSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_CSR_OFFSET              0x30         /**< \brief (SPI_CSR offset) Chip Select Register */
#define SPI_CSR_RESETVALUE          _U_(0x00000000); /**< \brief (SPI_CSR reset_value) Chip Select Register */

