zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/spi.h
#define SPI_WPCR_OFFSET             0xE4         /**< \brief (SPI_WPCR offset) Write Protection control Register */
#define SPI_WPCR_RESETVALUE         _U_(0x00000000); /**< \brief (SPI_WPCR reset_value) Write Protection control Register */

#define SPI_WPCR_WPEN_Pos           0            /**< \brief (SPI_WPCR) Write Protection Enable */
#define SPI_WPCR_WPEN               (_U_(0x1) << SPI_WPCR_WPEN_Pos)
#define SPI_WPCR_WPKEY_Pos          8            /**< \brief (SPI_WPCR) Write Protection Key Password */
#define SPI_WPCR_WPKEY_Msk          (_U_(0xFFFFFF) << SPI_WPCR_WPKEY_Pos)
#define SPI_WPCR_WPKEY(value)       (SPI_WPCR_WPKEY_Msk & ((value) << SPI_WPCR_WPKEY_Pos))
#define   SPI_WPCR_WPKEY_VALUE_Val        _U_(0x535049)   /**< \brief (SPI_WPCR) SPI Write Protection Key Password */
#define SPI_WPCR_WPKEY_VALUE        (SPI_WPCR_WPKEY_VALUE_Val      << SPI_WPCR_WPKEY_Pos)
#define SPI_WPCR_MASK               _U_(0xFFFFFF01) /**< \brief (SPI_WPCR) MASK Register */

/* -------- SPI_WPSR : (SPI Offset: 0xE8) (R/  32) Write Protection status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t WPVS:3;           /*!< bit:  0.. 2  Write Protection Violation Status  */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t WPVSRC:8;         /*!< bit:  8..15  Write Protection Violation Source  */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_WPSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_WPSR_OFFSET             0xE8         /**< \brief (SPI_WPSR offset) Write Protection status Register */
#define SPI_WPSR_RESETVALUE         _U_(0x00000000); /**< \brief (SPI_WPSR reset_value) Write Protection status Register */

#define SPI_WPSR_WPVS_Pos           0            /**< \brief (SPI_WPSR) Write Protection Violation Status */
#define SPI_WPSR_WPVS_Msk           (_U_(0x7) << SPI_WPSR_WPVS_Pos)
#define SPI_WPSR_WPVS(value)        (SPI_WPSR_WPVS_Msk & ((value) << SPI_WPSR_WPVS_Pos))
#define   SPI_WPSR_WPVS_WRITE_WITH_WP_Val _U_(0x1)   /**< \brief (SPI_WPSR) The Write Protection has blocked a Write access to a protected register (since the last read). */
#define   SPI_WPSR_WPVS_SWRST_WITH_WP_Val _U_(0x2)   /**< \brief (SPI_WPSR) Software Reset has been performed while Write Protection was enabled (since the last read or since the last write access on MR, IER, IDR or CSRx). */
#define   SPI_WPSR_WPVS_UNEXPECTED_WRITE_Val _U_(0x4)   /**< \brief (SPI_WPSR) Write accesses have been detected on MR (while a chip select was active) or on CSRi (while the Chip Select “i” was active) since the last read. */
#define SPI_WPSR_WPVS_WRITE_WITH_WP (SPI_WPSR_WPVS_WRITE_WITH_WP_Val << SPI_WPSR_WPVS_Pos)
#define SPI_WPSR_WPVS_SWRST_WITH_WP (SPI_WPSR_WPVS_SWRST_WITH_WP_Val << SPI_WPSR_WPVS_Pos)
#define SPI_WPSR_WPVS_UNEXPECTED_WRITE (SPI_WPSR_WPVS_UNEXPECTED_WRITE_Val << SPI_WPSR_WPVS_Pos)
#define SPI_WPSR_WPVSRC_Pos         8            /**< \brief (SPI_WPSR) Write Protection Violation Source */
#define SPI_WPSR_WPVSRC_Msk         (_U_(0xFF) << SPI_WPSR_WPVSRC_Pos)
#define SPI_WPSR_WPVSRC(value)      (SPI_WPSR_WPVSRC_Msk & ((value) << SPI_WPSR_WPVSRC_Pos))
#define SPI_WPSR_MASK               _U_(0x0000FF07) /**< \brief (SPI_WPSR) MASK Register */

/* -------- SPI_FEATURES : (SPI Offset: 0xF8) (R/  32) Features Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NCS:4;            /*!< bit:  0.. 3  Number of Chip Selects             */
    uint32_t PCONF:1;          /*!< bit:      4  Polarity is Configurable           */
    uint32_t PPNCONF:1;        /*!< bit:      5  Polarity is Positive if Polarity is not Configurable */
    uint32_t PHCONF:1;         /*!< bit:      6  Phase is Configurable              */
    uint32_t PHZNCONF:1;       /*!< bit:      7  Phase is Zero if Phase is not Configurable */
    uint32_t LENCONF:1;        /*!< bit:      8  Character Length is Configurable   */
    uint32_t LENNCONF:7;       /*!< bit:  9..15  Character Length if not Configurable */
    uint32_t EXTDEC:1;         /*!< bit:     16  External Decoder is True           */
    uint32_t CSNAATIMPL:1;     /*!< bit:     17  CSNAAT Features are Implemented    */
    uint32_t BRPBHSB:1;        /*!< bit:     18  Bridge Type is PB to HSB           */
    uint32_t FIFORIMPL:1;      /*!< bit:     19  FIFO in Reception is Implemented   */
    uint32_t SWPIMPL:1;        /*!< bit:     20  Spurious Write Protection is Implemented */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SPI_FEATURES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FEATURES_OFFSET         0xF8         /**< \brief (SPI_FEATURES offset) Features Register */

#define SPI_FEATURES_NCS_Pos        0            /**< \brief (SPI_FEATURES) Number of Chip Selects */
#define SPI_FEATURES_NCS_Msk        (_U_(0xF) << SPI_FEATURES_NCS_Pos)
#define SPI_FEATURES_NCS(value)     (SPI_FEATURES_NCS_Msk & ((value) << SPI_FEATURES_NCS_Pos))
#define SPI_FEATURES_PCONF_Pos      4            /**< \brief (SPI_FEATURES) Polarity is Configurable */
#define SPI_FEATURES_PCONF          (_U_(0x1) << SPI_FEATURES_PCONF_Pos)
#define SPI_FEATURES_PPNCONF_Pos    5            /**< \brief (SPI_FEATURES) Polarity is Positive if Polarity is not Configurable */
#define SPI_FEATURES_PPNCONF        (_U_(0x1) << SPI_FEATURES_PPNCONF_Pos)
#define SPI_FEATURES_PHCONF_Pos     6            /**< \brief (SPI_FEATURES) Phase is Configurable */
#define SPI_FEATURES_PHCONF         (_U_(0x1) << SPI_FEATURES_PHCONF_Pos)
#define SPI_FEATURES_PHZNCONF_Pos   7            /**< \brief (SPI_FEATURES) Phase is Zero if Phase is not Configurable */
#define SPI_FEATURES_PHZNCONF       (_U_(0x1) << SPI_FEATURES_PHZNCONF_Pos)
#define SPI_FEATURES_LENCONF_Pos    8            /**< \brief (SPI_FEATURES) Character Length is Configurable */
#define SPI_FEATURES_LENCONF        (_U_(0x1) << SPI_FEATURES_LENCONF_Pos)
#define SPI_FEATURES_LENNCONF_Pos   9            /**< \brief (SPI_FEATURES) Character Length if not Configurable */
#define SPI_FEATURES_LENNCONF_Msk   (_U_(0x7F) << SPI_FEATURES_LENNCONF_Pos)
#define SPI_FEATURES_LENNCONF(value) (SPI_FEATURES_LENNCONF_Msk & ((value) << SPI_FEATURES_LENNCONF_Pos))
#define SPI_FEATURES_EXTDEC_Pos     16           /**< \brief (SPI_FEATURES) External Decoder is True */
#define SPI_FEATURES_EXTDEC         (_U_(0x1) << SPI_FEATURES_EXTDEC_Pos)
#define SPI_FEATURES_CSNAATIMPL_Pos 17           /**< \brief (SPI_FEATURES) CSNAAT Features are Implemented */
#define SPI_FEATURES_CSNAATIMPL     (_U_(0x1) << SPI_FEATURES_CSNAATIMPL_Pos)
#define SPI_FEATURES_BRPBHSB_Pos    18           /**< \brief (SPI_FEATURES) Bridge Type is PB to HSB */
#define SPI_FEATURES_BRPBHSB        (_U_(0x1) << SPI_FEATURES_BRPBHSB_Pos)
#define SPI_FEATURES_FIFORIMPL_Pos  19           /**< \brief (SPI_FEATURES) FIFO in Reception is Implemented */
#define SPI_FEATURES_FIFORIMPL      (_U_(0x1) << SPI_FEATURES_FIFORIMPL_Pos)
#define SPI_FEATURES_SWPIMPL_Pos    20           /**< \brief (SPI_FEATURES) Spurious Write Protection is Implemented */
#define SPI_FEATURES_SWPIMPL        (_U_(0x1) << SPI_FEATURES_SWPIMPL_Pos)
#define SPI_FEATURES_MASK           _U_(0x001FFFFF) /**< \brief (SPI_FEATURES) MASK Register */

